app/views/posts/index.html.erb

  <%= form_tag("/posts", method: "get") do %>
    <%= select_tag "author", options_from_collection_for_select(Author.all, "id", "name"), include_blank: true %>
---
SELECT "authors".* FROM "authors"

<% if !params[:author].blank? %>
<%=  @posts = Post.where(author: params[:author]) %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8